Repository: biruk-77/passenger
Catalog: lib/l10n/app_*.arb
Languages: am

# pageHomeTitle
source: Home
am: ዋና ገጽ

source: Where to?
am: ወዴት ነው?

# pageSettingsTitle
source: Settings
am: ቅንብሮች

# profileUpdateSuccess
source: Profile updated successfully!
am: መገለጫ በተሳካ ሁኔታ ተዘምኗል!

# mapSetDestination
source: Tap to set your Destination
am: መድረሻዎን ለማዘጋጀት መታ ያድርጉ

# mapSetPickup
source: Tap to set your Pickup
am: የመነሻ ቦታዎን ለማዘጋጀት መታ ያድርጉ

source: Finding your location...
am: አካባቢዎን በማግኘት ላይ...

source: Cancel
am: ይቅር

source: Chat with Driver
am: ከሹፌሩ ጋር ይወያዩ

source: No messages yet.
am: እስካሁን ምንም መልዕክቶች የሉም።

source: Select Language
am: ቋንቋ ይምረጡ

# loginWelcomeBack
source: Welcome Back
am: እንኳን በደህና ተመለሱ

# loginWithPhoneSubtitle
source: Sign in with your phone number
am: በስልክ ቁጥርዎ ይግቡ

# loginWithEmailSubtitle
source: Sign in with your email
am: በኢሜልዎ ይግቡ

# loginMethodPhone
source: Phone
am: ስልክ

# loginMethodEmail
source: Email
am: ኢሜል

source: Phone Number
am: ስልክ ቁጥር

source: Email
am: ኢሜይል

# planningPanelSelectRide
source: Select a Ride
am: መኪና ይምረጡ

# planningPanelConfirmRide
source: Confirm Ride
am: ጉዞን ያረጋግጡ

# planningPanelConfirmButton
source: Confirm
am: ጉዞውን ያረጋግጡ

# planningPanelDistance
source: DISTANCE
am: ርቀት

# planningPanelDuration
source: DURATION
am: የሚፈጀው ጊዜ

# planningPanelNoRidesAvailable
source: No ride options available.
am: ምንም አይነት የጉዞ አማራጭ የለም።

source: Password
am: የይለፍ ቃል

# errorEnterPhoneNumber
source: Please enter a phone number
am: እባክዎ ስልክ ቁጥር ያስገቡ

# errorInvalidPhoneNumber
source: Enter a valid 9 or 10-digit number
am: ትክክለኛ ባለ 9 ወይም 10 አሃዝ ቁጥር ያስገቡ

# errorEnterEmail
source: Please enter an email
am: እባክዎ ኢሜል ያስገቡ

# errorInvalidEmail
source: Please enter a valid email.
am: እባክዎ ትክክለኛ ኢሜይል ያስገቡ

# errorEnterPassword
source: Please enter your password
am: እባክዎ የይለፍ ቃልዎን ያስገቡ

# sendOtpButton
source: SEND OTP
am: ኦቲፒ ላክ

# signInButton
source: SIGN IN
am: ግባ

# dontHaveAccount
source: Don't have an account?
am: አካውንት የለዎትም?

source: Register
am: ይመዝገቡ

# drawerProfileSettings
source: Profile Settings
am: የመገለጫ ቅንብሮች

# drawerPaymentMethod
source: Payment Method
am: የክፍያ ዘዴ

# drawerRideHistory
source: Ride History
am: የጉዞ ታሪክ

# drawerSupport
source: Support
am: ድጋፍ

# drawerSettings
source: Settings
am: ቅንብሮች

# drawerLogout
source: Logout
am: ውጣ

# drawerGuestUser
source: Guest User
am: እንግዳ ተጠቃሚ

# drawerWallet
source: Wallet
am: ዋሌት

# drawerRating
source: Rating
am: ደረጃ

# drawerTrips
source: Trips
am: ጉዞዎች

# drawerWalletBalance
source: Birr {balance}
am: ብር {balance}

# appVersion
source: Version {versionNumber}
am: ስሪት {versionNumber}

# settingsTitle
source: Settings
am: ቅንብሮች

# settingsSectionAccount
source: ACCOUNT
am: አካውንት

# settingsEditProfile
source: Edit Profile
am: መገለጫ አርትዕ

# settingsEditProfileSubtitle
source: Manage your name, email, and photo
am: ስምዎን፣ ኢሜልዎን እና ፎቶዎን ያስተዳድሩ

# settingsSectionPreferences
source: PREFERENCES
am: ምርጫዎች

# settingsLanguage
source: Language
am: ቋንቋ

# settingsDarkMode
source: Dark Mode
am: ጨለማ ገጽታ

# settingsSectionAbout
source: ABOUT
am: ስለ

# settingsHelpSupport
source: Help & Support
am: እገዛ እና ድጋፍ

# settingsTermsOfService
source: Terms of Service
am: የአገልግሎት ውል

# settingsPrivacyPolicy
source: Privacy Policy
am: የግላዊነት ፖሊሲ

# registerErrorPhoneInvalid
source: Please enter a valid phone number
am: እባኮትን ትክክለኛ ስልክ ቁጥር ያስገቡ

source: optional
am: አማራጭ

# registerConfirmPassword
source: Confirm Password
am: የይለፍ ቃል ያረጋግጡ

# registerErrorEnterConfirmPassword
source: Please enter confirm password
am: እባኮትን የይለፍ ቃል አረጋግጥ ያስገቡ

# registerErrorPasswordMismatch
source: Passwords do not match
am: የይለፍ ቃሎች አይዛመዱም

# editProfileTitle
source: Edit Profile
am: መገለጫ አርትዕ

source: Personal Information
am: የግል መረጃ

source: Full Name
am: ሙሉ ስም

source: Email Address
am: ኢሜይል አድራሻ

source: Emergency Contacts
am: የአደጋ ጊዜ እውቂያዎች

source: Contact #{number}
am: እውቂያ #{number}

# contactFullName
source: Contact's Full Name
am: የእውቂያ ሙሉ ስም

# contactPhoneNumber
source: Contact's Phone Number
am: የእውቂያ ስልክ ቁጥር

source: Add Contact
am: እውቂያ ጨምር

source: SAVE CHANGES
am: ለውጦችን አስቀምጥ

source: Security
am: ደህንነት

source: Change Password
am: የይለፍ ቃል ቀይር

source: Current Password
am: የአሁኑ የይለፍ ቃል

source: New Password
am: አዲስ የይለፍ ቃል

source: Confirm New Password
am: አዲስ የይለፍ ቃል አረጋግጥ

# errorEnterName
source: Please enter your name.
am: እባክዎ ስምዎን ያስገቡ

# errorEnterNameForContact
source: Enter name for contact
am: የእውቂያ ስም ያስገቡ

# errorEnterPhoneForContact
source: Enter phone for contact
am: የእውቂያ ስልክ ያስገቡ

# errorInvalidPhone
source: Invalid phone number format
am: የተሳሳተ የስልክ ቁጥር ቅርጸት

# errorEnterCurrentPassword
source: Please enter your current password to set a new one.
am: አዲስ የይለፍ ቃል ለማዘጋጀት እባክዎ የአሁኑን የይለፍ ቃልዎን ያስገቡ

# errorEnterNewPassword
source: Enter a new password
am: አዲስ የይለፍ ቃል ያስገቡ

# errorPasswordTooShort
source: Password must be at least 6 characters.
am: የይለፍ ቃል ቢያንስ 6 ቁምፊዎች መሆን አለበት

# errorPasswordsDoNotMatch
source: Passwords do not match.
am: የይለፍ ቃላት አይዛመዱም

source: Profile update failed.
am: መገለጫ ማዘመን አልተሳካም

# passwordUpdateSuccess
source: Password updated successfully!
am: የይለፍ ቃል በተሳካ ሁኔታ ተቀይሯል!

# passwordUpdateFailed
source: Failed to update password.
am: የይለፍ ቃል መቀየር አልተሳካም።

# authWelcome
source: Welcome
am: እንኳን በደህና መጡ

# authSignInToContinue
source: Sign in to your account to continue
am: ለመቀጠል ወደ አካውንትዎ ይግቡ

# authCreateAccount
source: Create an Account
am: አካውንት ይፍጠሩ

# authGetStarted
source: Let's get you started
am: እንጀምር

# authFullName
source: Full Name
am: ሙሉ ስም

# authPhoneNumber
source: Phone Number
am: ስልክ ቁጥር

# authPassword
source: Password
am: የይለፍ ቃል

# authSignIn
source: Sign In
am: ይግቡ

# authRegister
source: Create Account
am: አካውንት ይፍጠሩ

# authNoAccount
source: Don't have an account?
am: አካውንት የለዎትም?

# authHaveAccount
source: Already have an account?
am: አካውንት አለዎት?

# authErrorEnterFullName
source: Please enter your full name
am: እባክዎ ሙሉ ስምዎን ያስገቡ

# authErrorEnterPhone
source: Please enter a phone number
am: እባክዎ ስልክ ቁጥር ያስገቡ

# authErrorInvalidPhone
source: Please enter a valid phone number
am: እባክዎ ትክክለኛ ስልክ ቁጥር ያስገቡ

# authErrorEnterPassword
source: Please enter a password
am: እባክዎ የይለፍ ቃል ያስገቡ

# authErrorPasswordShort
source: Password must be at least 6 characters
am: የይለፍ ቃል ቢያንስ 6 ቁምፊዎች መሆን አለበት

# authSwitchToRegister
source: Register
am: ይመዝገቡ

# authSwitchToSignIn
source: Sign In
am: ይግቡ

# registerCreateAccount
source: Create an Account
am: አካውንት ይፍጠሩ

# registerGetStarted
source: Let's get you started
am: እንጀምር

# registerFullName
source: Full Name
am: ሙሉ ስም

# registerPhoneNumber
source: Phone Number
am: ስልክ ቁጥር

# registerPassword
source: Password
am: የይለፍ ቃል

# registerButton
source: Create Account
am: አካውንት ይፍጠሩ

# registerHaveAccount
source: Already have an account?
am: አካውንት አለዎት?

# registerSignIn
source: Sign In
am: ይግቡ

# registerErrorEnterFullName
source: Please enter your full name
am: እባክዎ ሙሉ ስምዎን ያስገቡ

# registerErrorEnterPhone
source: Please enter a phone number
am: እባክዎ ስልክ ቁጥር ያስገቡ

# registerErrorInvalidPhone
source: Please enter a valid phone number
am: እባክዎ ትክክለኛ ስልክ ቁጥር ያስገቡ

# registerErrorEnterPassword
source: Please enter a password
am: እባክዎ የይለፍ ቃል ያስገቡ

# registerErrorPasswordShort
source: Password must be at least 6 characters
am: የይለፍ ቃል ቢያንስ 6 ቁምፊዎች መሆን አለበት

# historyScreenTitle
source: Ride History
am: የጉዞ ታሪክ

# historyLoading
source: Loading...
am: በመጫን ላይ...

# historyErrorTitle
source: Something Went Wrong
am: ስህተት አጋጥሟል

# historyErrorMessage
source: An unexpected error occurred. Please check your connection.
am: ያልተጠበቀ ስህተት ተከስቷል። እባክዎ የበይነመረብ ግንኙነትዎን ያረጋግጡ።

# historyRetryButton
source: Try Again
am: እንደገና ሞክር

# historyEmptyTitle
source: No Rides Yet
am: እስካሁን ምንም ጉዞ የለም

# historyEmptyMessage
source: Your completed trips will appear here.
am: ያጠናቀቋቸው ጉዞዎች እዚህ ይታያሉ።

# historyCardFrom
source: From
am: ከ

# historyCardTo
source: To
am: ወደ

# historyCardFare
source: Fare:
am: ዋጋ:

# historyCardUnknownLocation
source: Unknown Location
am: ቦታው አይታወቅም

# historyStatusCompleted
source: COMPLETED
am: ተጠናቋል

# historyStatusCanceled
source: CANCELED
am: ተሰርዟል

# historyStatusPending
source: PENDING
am: በመጠባበቅ ላይ

# currencySymbol
source: Birr
am: ብር

# discoveryWhereTo
source: Where to?
am: ወዴት እንሂድ?

# discoverySearchDestination
source: Search destination
am: መድረሻ ይፈልጉ

# discoveryHome
source: Home
am: ቤት

# discoveryWork
source: Work
am: ሥራ

# discoveryAddHome
source: Add Home
am: ቤት ያክሉ

# discoveryAddWork
source: Add Work
am: ሥራ ያክሉ

# discoveryFavoritePlaces
source: Favorite Places
am: ተወዳጅ ቦታዎች

# discoveryAddFavoritePrompt
source: Tap the '+' to add a favorite destination.
am: ተወዳጅ መድረሻ ለማከል '+' ይንኩ።

# discoveryRecentTrips
source: Recent Trips
am: የቅርብ ጊዜ ጉዞዎች

# discoveryRecentTripRemoved
source: Recent trip removed.
am: የቅርብ ጊዜ ጉዞ ተወግዷል።

# discoveryClearAll
source: Clear All
am: ሁሉንም አጽዳ

# discoveryMenuChangeAddress
source: Change Address
am: አድራሻ ይቀይሩ

# discoveryMenuRemove
source: Remove
am: አስወግድ

# searchingContactingDrivers
source: Contacting Nearby Drivers
am: በአቅራቢያ ያሉ ሹፌሮችን በማነጋገር ላይ

# searchingPleaseWait
source: Please wait while we find a ride for you.
am: እባክዎ መጓጓዣ እስክናገኝልዎ ድረስ ይጠብቁ።

# searchingDetailFrom
source: FROM
am: ከ

# searchingDetailTo
source: TO
am: ወደ

# searchingDetailVehicle
source: VEHICLE
am: ተሽከርካሪ

# searchingDetailVehicleValue
source: {name} • Est. {price} Birr
am: {name} • ገምት. {price} ብር

# searchingCancelButton
source: Cancel Search
am: ፍለጋን ሰርዝ

# planningPanelRideOptionsError
source: Could not load ride options.
am: የጉዞ አማራጮችን መጫን አልተቻለም።

# planningPanelPrice
source: Birr: {price}
am: ብር: {price}

# driverOnWayEnRouteToDestination
source: En Route to Destination
am: ወደ መድረሻ በመጓዝ ላይ

# driverOnWayDriverArriving
source: Your Driver is Arriving
am: ሹፌርዎ እየመጣ ነው

# driverOnWayBookingId
source: Booking ID:
am: የቦታ ማስያዣ ቁጥር:

# driverOnWayDriverId
source: Driver ID:
am: የሹፌር መለያ:

# driverOnWayPickup
source: Pickup:
am: መነሻ:

# driverOnWayDropoff
source: Dropoff:
am: መድረሻ:

# driverOnWayCall
source: Call
am: ይደውሉ

# driverOnWayChat
source: Chat
am: ይፃፉ

# driverOnWayCancelRide
source: Cancel Ride
am: ጉዞ ሰርዝ

# driverOnWayDriverNotAvailable
source: Driver N/A
am: ሹፌር የለም

# driverOnWayNotAvailable
source: N/A
am: የለም

# driverOnWayColorNotAvailable
source: Color N/A
am: ቀለም የለም

# driverOnWayModelNotAvailable
source: Model N/A
am: ሞዴል የለም

# driverOnWayPlateNotAvailable
source: PLATE N/A
am: ሰሌዳ ቁጥር የለም

# driverOnWayVehicleUnknown
source: Unknown
am: ያልታወቀ

# ongoingTripEnjoyRide
source: Enjoy your ride!
am: ጉዞዎን ይደሰቱ!

# ongoingTripOnYourWay
source: You are on your way to the destination.
am: ወደ መድረሻዎ መንገድ ላይ ነዎት።

# ongoingTripDriverOnWay
source: Driver is on the way
am: ሹፌሩ በመንገድ ላይ ነው

# ongoingTripDriverArrivingIn
source: Your driver will arrive in approximately {eta}
am: ሹፌርዎ በግምት በ {eta} ውስጥ ይደርሳል

# ongoingTripYourDriver
source: Your Driver
am: የእርስዎ ሹፌር

# ongoingTripStandardCar
source: Standard Car
am: የተለመደ መኪና

# ongoingTripDefaultColor
source: Black
am: ጥቁር

# ongoingTripCall
source: Call
am: ይደውሉ

# ongoingTripChat
source: Chat
am: ይወያዩ

# ongoingTripCancel
source: Cancel
am: ይቅር

# postTripCompleted
source: Trip Completed!
am: ጉዞ ተጠናቋል!

# postTripYourDriver
source: Your Driver
am: የእርስዎ ሹፌር

# postTripRateExperience
source: Rate your experience
am: ልምድዎን ደረጃ ይስጡ

# postTripAddComment
source: Add a detailed comment (optional)
am: ዝርዝር አስተያየት ያክሉ (በፍላጎት)

# postTripSubmitFeedback
source: Submit Feedback
am: አስተያየት ያስገቡ

# postTripSkip
source: Skip
am: ዝለል

# postTripShowAppreciation
source: Show your appreciation?
am: አድናቆትዎን ያሳዩ?

# postTripOther
source: Other
am: ሌላ

# postTripFinalFare
source: Final Fare
am: የመጨረሻ ዋጋ

# postTripDistance
source: Distance
am: ርቀት

# postTripTagExcellentService
source: Excellent Service
am: ምርጥ አገልግሎት

# postTripTagCleanCar
source: Clean Car
am: ንጹህ መኪና

# postTripTagSafeDriver
source: Safe Driver
am: ጥንቁቅ ሹፌር

# postTripTagGoodConversation
source: Good Conversation
am: ጥሩ ውይይት

# postTripTagFriendlyAttitude
source: Friendly Attitude
am: ወዳጃዊ አመለካከት

# driverInfoWindowVehicleStandard
source: Standard
am: የተለመደ

# driverInfoWindowAvailable
source: Available
am: ይገኛል

# driverInfoWindowOnTrip
source: On Trip
am: በጉዞ ላይ

# driverInfoWindowSelect
source: Select
am: ምረጥ

# notificationRideConfirmedTitle
source: Your Ride is Confirmed!
am: ጉዞዎ ተረጋግጧል!

# notificationRideConfirmedBody
source: Driver {driverName} is on the way.
am: ሹፌር {driverName} በመንገድ ላይ ነው።

# notificationDriverArrivedTitle
source: Your Driver Has Arrived!
am: ሹፌርዎ ደርሷል!

# notificationDriverArrivedBody
source: Please meet your driver at the pickup location.
am: እባክዎ ሹፌርዎን በመነሻ ቦታ ያግኙት።

# notificationTripStartedTitle
source: Your Trip Has Started
am: ጉዞዎ ተጀምሯል

# notificationTripStartedBody
source: Enjoy your ride! We wish you a safe journey.
am: ጉዞዎን ይደሰቱ! ደህንነቱ የተጠበቀ ጉዞ እንመኛለን።

# notificationTripCompletedTitle
source: Trip Completed!
am: ጉዞ ተጠናቋል!

# notificationTripCompletedBody
source: Thank you for riding with us. We hope to see you again soon.
am: ከእኛ ጋር ስለተጓዙ እናመሰግናለን። በቅርቡ እንደገና እንደምናይዎት ተስፋ እናደርጋለን።

# notificationRideCanceledTitle
source: Ride Canceled
am: ጉዞ ተሰርዟል

# notificationRideCanceledBody
source: Your ride request has been canceled.
am: የጉዞ ጥያቄዎ ተሰርዟል።

# notificationRequestSentTitle
source: Ride Requested
am: የጉዞ ጥያቄ ቀርቧል

# notificationRequestSentBody
source: We have received your request and are now searching for nearby drivers.
am: ጥያቄዎን ተቀብለናል እና በአቅራቢያ ያሉ ሹፌሮችን እየፈለግን ነው።

# notificationNewMessageTitle
source: New Message from {driverName}
am: ከ{driverName} አዲስ መልዕክት

# notificationNoDriversTitle
source: No Drivers Available
am: ምንም ሹፌር አልተገኘም

# notificationNoDriversBody
source: We couldn't find a driver nearby. Please try again in a moment.
am: በአቅራቢያዎ ሹፌር ማግኘት አልቻልንም። እባክዎ ከትንሽ ጊዜ በኋላ እንደገና ይሞክሩ።

# notificationBookingErrorTitle
source: Booking Error
am: የቡኪንግ ስህተት

source: Arrived
am: ደርሷል

# editProfileSubtitle
source: Keep your personal information up to date.
am: የግል መረጃዎን ወቅታዊ ያድርጉ

# notificationSearchingBody
source: Searching for drivers within a {radius} km radius.
am: በ {radius} ኪ.ሜ ራዲየስ ውስጥ ሹፌሮችን በመፈለግ ላይ።

# notificationDriverNearbyTitle
source: Driver is Nearby
am: ሹፌሩ በአቅራቢያ ነው።

# notificationDriverNearbyBody
source: Your driver is now less than {distance} meters away.
am: ሹፌርዎ አሁን ከ {distance} ሜትር ባነሰ ርቀት ላይ ነው።

# notificationDriverVeryCloseTitle
source: Driver is Very Close
am: ሹፌሩ በጣም ቀርቧል

# notificationDriverVeryCloseBody
source: Get ready! Your driver is almost here.
am: ይዘጋጁ! ሹፌርዎ ሊደርስ ነው።

# offlineOrderTitle
source: Offline Order
am: ከመስመር ውጭ ትዕዛዝ

# offlineRequestTitle
source: Request Ride via SMS
am: በኤስኤምኤስ поездка ይጠይቁ

# offlineRequestSubtitle
source: No internet? No problem. Enter your locations below and we will call you back to confirm your booking.
am: ኢንተርኔት የለም? ችግር የለም። ከታች ያሉትን ቦታዎች ያስገቡ እና ትዕዛዝዎን ለማረጋገጥ ተመልሰን እንደውልዎታለን።

# pickupLocationHint
source: Enter Pickup Location
am: የመነሻ ቦታ ያስገቡ

# destinationLocationHint
source: Enter Destination
am: መድረሻ ያስገቡ

# pickupValidationError
source: Please enter a pickup location
am: እባክዎ የመነሻ ቦታ ያስገቡ

# destinationValidationError
source: Please enter a destination
am: እባክዎ መድረሻ ያስገቡ

# prepareSmsButton
source: Prepare SMS Request
am: የኤስኤምኤስ ጥያቄ አዘጋጅ

# smsCouldNotOpenError
source: Could not open your SMS application.
am: የእርስዎን የኤስኤምኤስ መተግበሪያ መክፈት አልተቻለም።

# smsGenericError
source: An error occurred while creating the SMS.
am: ኤስኤምኤስ ሲፈጥሩ ስህተት ተፈጥሯል።

# step1Title
source: Enter Locations
am: ቦታዎችን ያስገቡ

# step1Subtitle
source: Tell us where to pick you up and where you're going.
am: የት እንደምንወስድዎት እና ወዴት እንደሚሄዱ ይንገሩን።

# step2Title
source: Prepare SMS
am: ኤስኤምኤስ አዘጋጅ

# step2Subtitle
source: We'll create a text message with your details.
am: ከእርስዎ ዝርዝሮች ጋር የጽሑፍ መልእክት እንፈጥራለን።

# step3Title
source: Await Our Call
am: የእኛን ጥሪ ይጠብቁ

# step3Subtitle
source: Our team will call you shortly to confirm your ride.
am: ጉዞዎን ለማረጋገጥ ቡድናችን በቅርቡ ይደውልልዎታል።

# smsOfflineLogin
source: No internet? Order by SMS
am: ኢንተርኔት የለም? በኤስኤምኤስ ይዘዙ

# smsLaunchSuccessTitle
source: SMS App Opened
am: የኤስኤምኤስ መተግበሪያ ተከፍቷል

# smsLaunchSuccessMessage
source: Please review the message and press 'Send' to submit your request.
am: እባክዎ መልዕክቱን ይከልሱ እና ጥያቄዎን ለማስገባት 'שלח' የሚለውን ይጫኑ።

# smsCapabilityError
source: This device is not capable of sending SMS messages.
am: ይህ መሳሪያ የኤስኤምኤስ መልዕክቶችን መላክ አይችልም።

# smsLaunchError
source: Could not open the SMS application. Please check your device settings.
am: የኤስኤምኤስ መተግበሪያውን መክፈት አልተቻለም። እባክዎ የመሣሪያዎን ቅንብሮች ያረጋግጡ።

# offline
source: offline SMS
am: ኦፍላይን ኤስኤምኤስ

source: Skip
am: ዝለል

source: FINISH
am: ጨርስ

# completeProfileTitle
source: One Last Step
am: አንድ የመጨረሻ ደረጃ

# completeProfileSubtitle
source: Complete your profile to continue.
am: ለመቀጠል መገለጫዎን ይሙሉ

source: SAVE LOCATION AS
am: ቦታውን ያስቀምጡ እንደ

source: Home
am: ቤት

source: Work
am: ሥራ

source: Favorite
am: ተወዳጅ

source: GO TO DESTINATION
am: ወደ መድረሻ ይሂዱ

source: SAVE AS HOME
am: እንደ ቤት ያስቀምጡ

source: SAVE AS WORK
am: እንደ ሥራ ያስቀምጡ

source: ADD TO FAVORITES
am: ወደ ተወዳጆች ያክሉ

source: CONFIRM LOCATION
am: ቦታውን ያረጋግጡ

source: Current Location
am: አሁን ያለሁበት ቦታ

source: Selected Location
am: የተመረጠ ቦታ

# locationNotAvailable
source: Current location not available. Ensure permissions are granted.
am: አሁን ያለበት ቦታ የለም። ፈቃዶችን ያረጋግጡ።

# selectPickupAndDestination
source: Please select both pickup and destination.
am: የመጫኛ እና መድረሻ ቦታ ይምረጡ።

# clearRecentPlacesQuestion
source: Clear recent places?
am: የቅርብ ጊዜ ቦታዎችን ያጽዱ?

# actionCannotBeUndone
source: This action cannot be undone.
am: ይህ እርምጃ ሊቀለበስ አይችልም።

source: Clear
am: አጽዳ

source: Set Route
am: መንገድ ያስቀምጡ

source: Select Location
am: ቦታ ይምረጡ

source: Pickup Location
am: መነሻ ቦታ

source: Destination
am: መድረሻ

source: Set on Map
am: በካርታ ላይ አስቀምጥ

source: Current
am: አሁን ያለ

source: Saved Places
am: የተቀመጡ ቦታዎች

source: Recent
am: የቅርብ ጊዜ

source: Add Home
am: ቤት ጨምር

source: Add Work
am: ሥራ ጨምር

# setPickup
source: Set as Pickup
am: መበገሲ ኣድርግ

# setDestination
source: Set as Destination
am: መወዳእታ ኣድርግ

source: Confirm Pickup
am: መንኮራኩሩን አረጋግጥ

source: Confirm Destination
am: መድረሻውን አረጋግጥ

# discoverySetHome
source: Set as Home
am: ቤት አድርግ

# discoverySetWork
source: Set as Work
am: ስራ አድርግ

# discoveryAddFavorite
source: Add Favorite
am: ተወዳጅ አክል

source: Set as Pickup Location
am: መነሻ

source: Set as Destination
am: መድረሻ አድርግ

source: Update Route
am: መንገድ አዘምን

source: Set Pickup First
am: መነሻ

source: Save Home
am: ቤት አስቀምጥ

source: Save Work
am: ስራ አስቀምጥ

source: Add Favorite
am: ተወዳጅ አክል

source: Set Your Route
am: መንገድዎን ያዘጋጁ

source: Where would you like to go?
am: የት መሄድ ይፈልጋሉ?

source: Change Address
am: አድራሻ ቀይር

source: Remove
am: አስወግድ

# itemRemovedSuccessfully
source: {itemType} removed successfully
am: {itemType} በተሳካ ሁኔታ ተወግዷል

source: Home Address
am: የቤት አድራሻ

source: Work Address
am: የሥራ አድራሻ

source: Favorite Place
am: ተወዳጅ ቦታ

source: Place Options
am: የቦታ አማራጮች

# clearAllDataTitle
source: Clear All Data?
am: ሁሉንም ውሂብ ለማጥፋት ይፈልጋሉ?

# clearAllDataContent
source: This will remove all your home, work, favorites, and recent places. This action cannot be undone.
am: ይህ ሁሉንም ቤት፣ ስራ፣ ተወዳጆች እና የቅርብ ጊዜ ቦታዎችዎን ያስወግዳል። ይህ እርምጃ ሊቀለበስ አይችልም።

source: Clear Everything
am: ሁሉንም አጥፋ

# allDataCleared
source: All data cleared successfully
am: ሁሉም ውሂብ በተሳካ ሁኔታ ተጠርጓል

# searchErrorTitle
source: Search Failed
am: ፍለጋ አልተሳካም

# searchErrorMessage
source: Please check your internet connection and try again.
am: እባክዎ የበይነመረብ ግንኙነትዎን ያረጋግጡ እና እንደገና ይሞክሩ።

source: No Results Found
am: ምንም ውጤት አልተገኘም

# tryDifferentSearch
source: Try a different search term
am: የተለየ የፍለጋ ቃል ይሞክሩ

source: Pick on Map
am: ካርታ ላይ ምረጥ

source: Clear All
am: ሁሉንም አጥፋ

source: Add
am: አክል

source: Add your home address
am: የቤት አድራሻዎን ያስገቡ

source: Add your work address
am: የሥራ አድራሻዎን ያስገቡ

source: Favorites
am: ተወዳጆች

source: Recent Trips
am: የቅርብ ጊዜ ጉዞዎች

source: No Favorites Yet
am: እስካሁን ምንም ተወዳጆች የሉም

# addFavoritesMessage
source: Add your frequently visited places for quick access
am: በፍጥነት ለመድረስ በብዛት የሚጎበኟቸውን ቦታዎች ያክሉ።

source: No Recent Trips
am: የቅርብ ጊዜ ጉዞዎች የሉም

# recentTripsMessage
source: Your recent destinations will appear here
am: የቅርብ ጊዜ መዳረሻዎችዎ እዚህ ይታያሉ።

# recentTripsCount
source: {count,plural, =0{No recent trips} =1{1 recent trip} other{{count} recent trips}}
am: {count,plural, =0{የቅርብ ጊዜ ጉዞዎች የሉም} =1{1 የቅርብ ጊዜ ጉዞ} other{{count} የቅርብ ጊዜ ጉዞዎች}}

# recentsCleared
source: Recent trips cleared
am: የቅርብ ጊዜ ጉዞዎች ተጠርገዋል

source: Recent trip removed
am: የቅርብ ጊዜ ጉዞ ተወግዷል

source: Searching...
am: በመፈለግ ላይ...

source: Your current position
am: የአሁኑ አካባቢዎ

source: Use Current Location
am: የአሁኑን አካባቢ ይጠቀሙ

source: Plan Your Route
am: መንገድዎን ያቅዱ

# planningPanelVehicleSelection
source: VEHICLE SELECTION
am: የተሽከርካሪ ምርጫ

# planningPanelEngageButton
source: ENGAGE
am: አስጀምር

# planningPanelTitle
source: Choose Your Ride
am: ጉዞዎን ይምረጡ

# noRidesAvailable
source: No rides available in this area.
am: በዚህ አካባቢ ምንም የሚገኝ ጉዞ የለም።

# vehicleTaglineStandard
source: The perfect everyday essential.
am: ለትዕለት ተስማሚ ምርጫ።

# vehicleTaglineComfort
source: Extra comfort for a relaxing ride.
am: ለተመቸ ጉዞ ተጨማሪ ምቾት።

# vehicleTaglineVan
source: Room for the whole crew.
am: ለሁሉም የሚሆን ሰፊ ቦታ።

# vehicleTaglineDefault
source: A great choice for your trip.
am: ለጉዞዎ ምርጥ ምርጫ።

# fareCalculating
source: Calculating...
am: ዋጋ በማስላት ላይ...

source: RIDE
am: ጉዞ

# confirmButtonRequesting
source: REQUESTING...
am: እየተጠየቀ ነው...

# confirmButtonRequest
source: REQUEST
am: ይጠይቁ

# driverOnWayEnjoyYourRide
source: Enjoy your ride!
am: ጉዞዎን ይደሰቱ!

# driverOnWayMeetAtPickup
source: Please meet them at the pickup location.
am: እባክዎ መነሻ ቦታ ላይ ይጠብቁ።

# postTripAddCompliment
source: Add a compliment
am: ምስጋና ጨምር

# ongoingTripTitle
source: On Trip
am: በጉዞ ላይ

source: Trip Duration
am: የጉዞ ቆይታ

# safetyAndTools
source: Safety & Tools
am: ደህንነት እና መሳሪያዎች

source: Share Trip
am: ጉዞ አጋራ

# emergencySOS
source: SOS
am: የአደጋ ጊዜ ጥሪ

# emergencyDialogTitle
source: Emergency Assistance
am: የአደጋ ጊዜ እርዳታ

# emergencyDialogContent
source: This will contact local emergency services. Are you sure you want to proceed?
am: ይህ የአካባቢውን የድንገተኛ አደጋ አገልግሎት ያገናኛል። ለመቀጠል እርግጠኛ ነዎት?

# emergencyDialogCancel
source: Cancel
am: ይቅር

# emergencyDialogConfirm
source: Call Now
am: አሁን ይደውሉ

# phoneNumberNotAvailable
source: Driver's phone number is not available.
am: የሹፌሩ ስልክ ቁጥር የለም።

# couldNotLaunch
source: Could not launch {url}
am: {url} መክፈት አልተቻለም

source: Discount
am: ቅናሽ

# myTripsScreenTitle
source: My Contract Trips
am: የእኔ የኮንትራት ጉዞዎች

# myTripsScreenRefresh
source: Refresh
am: አድስ

# myTripsScreenErrorPrefix
source: Error: {errorMessage}
am: ስህተት፡ {errorMessage}

# myTripsScreenRetry
source: Retry
am: እንደገና ሞክር

# myTripsScreenNoTrips
source: No contract trips found.
am: ምንም የኮንትራት ጉዞዎች አልተገኙም።

# myTripsScreenTripIdPrefix
source: Trip ID:
am: የጉዞ መለያ፡

# myTripsScreenFromPrefix
source: From:
am: ከ፡

# myTripsScreenToPrefix
source: To:
am: ወደ፡

# myTripsScreenPickupPrefix
source: Pickup:
am: መነሻ ሰዓት፡

# myTripsScreenDropoffPrefix
source: Dropoff:
am: መድረሻ ሰዓት፡

# myTripsScreenFarePrefix
source: Fare: ETB
am: ዋጋ፡ ብር

# myTripsScreenRatingPrefix
source: Rating:
am: ደረጃ፡

# myTripsScreenNotAvailable
source: N/A
am: አልተገኘም

# tripStatusCompleted
source: COMPLETED
am: ተጠናቋል

# tripStatusStarted
source: STARTED
am: ተጀምሯል

# tripStatusPending
source: PENDING
am: በመጠባበቅ ላይ

# tripStatusCancelled
source: CANCELLED
am: ተሰርዟል

# drawerAvailableContracts
source: Available Contracts
am: የሚገኙ ውሎች

# drawerMyTransactions
source: My Transactions
am: የኔ ግብይቶች

# drawerLogoutForgetDevice
source: Logout & Forget Device
am: ውጣ እና መሳሪያውን እርሳ

source: Contract Details
am: የውል ዝርዝሮች

# contractPanelTitle
source: Contract Rides
am: የኮንትራት ጉዞዎች

# contractPanelSubtitle
source: Your premium travel experience
am: የእርስዎ ልዩ የጉዞ ልምድ
