Repository: biruk-77/passenger
Catalog: lib/l10n/app_*.arb
Languages: am

# contractPanelActiveSubscriptionsTitle
source: Active Subscriptions
am: በስራ ላይ ያሉ ምዝገባዎች

# contractPanelActiveSubscriptionsSubtitle
source: Your current premium rides
am: የአሁኑ ልዩ ጉዞዎችዎ

# contractPanelErrorLoadSubscriptions
source: Unable to load your subscriptions
am: የእርስዎን ምዝገባዎች መጫን አልተቻለም

# contractPanelEmptySubscriptions
source: No active subscriptions found
am: ምንም በስራ ላይ ያለ ምዝገባ አልተገኘም

# contractPanelEmptySubscriptionsSubtitle
source: Create your first premium ride below
am: የመጀመሪያውን ልዩ ጉዞዎን ከታች ይፍጠሩ

# contractPanelNewContractsTitle
source: New Contracts
am: አዲስ ውሎች

# contractPanelNewContractsSubtitle
source: Upgrade your travel experience
am: የጉዞ ልምድዎን ያሻሽሉ

# contractPanelErrorLoadContracts
source: Unable to load contract types
am: የውል አይነቶችን መጫን አልተቻለም

# contractPanelEmptyContracts
source: No contracts available
am: ምንም የሚገኝ ውል የለም

# contractPanelEmptyContractsSubtitle
source: Check back later for new offers
am: ለአዲስ ቅናሾች ቆይተው ይመልከቱ

# contractPanelRetryButton
source: Try Again
am: እንደገና ይሞክሩ

# contractPanelDiscountOff
source: {discountValue}% OFF
am: {discountValue}% ቅናሽ

# contractPickerTitlePickup
source: Select Pickup Location
am: መነሻ ቦታ ይምረጡ

# contractPickerTitleDestination
source: Select Destination
am: መድረሻ ቦታ ይምረጡ

# contractPickerHintPickup
source: Search for pickup...
am: መነሻ ቦታ ይፈልጉ...

# contractPickerHintDestination
source: Search for destination...
am: መድረሻ ቦታ ይፈልጉ...

# contractPickerNoRecents
source: No recent searches found.
am: በቅርብ ጊዜ የተደረጉ ፍለጋዎች የሉም።

# contractPickerRecentsTitle
source: Recent Searches
am: የቅርብ ጊዜ ፍለጋዎች

# contractPickerNoResults
source: No results found.
am: ምንም ውጤት አልተገኘም።

# contractDriverLoading
source: Locating your contract driver...
am: የኮንትራት ሹፌርዎን በማግኘት ላይ...

# contractDriverTypeLabel
source: Contract Driver
am: የኮንትራት ሹፌር

# contractDetailsTitle
source: Contract Details
am: የኮንትራት ዝርዝሮች

# contractDetailsSubscriptionId
source: Subscription ID
am: የምዝገባ መለያ

# contractDetailsContractType
source: Contract Type
am: የኮንትራት አይነት

# contractDetailsScheduledRide
source: Scheduled Ride
am: የታቀደ ጉዞ

# contractDetailsTimeRemaining
source: Time Remaining
am: የቀረው ጊዜ

source: Contract Expired
am: ኮንትራቱ አብቅቷል

# contractTimeLeftDays
source: {count,plural, =1{{count} day left} other{{count} days left}}
am: {count,plural, =1{{count} ቀን ቀረው} other{{count} ቀናት ቀሩት}}

# contractTimeLeftHours
source: {count,plural, =1{{count} hour left} other{{count} hours left}}
am: {count,plural, =1{{count} ሰዓት ቀረው} other{{count} ሰዓታት ቀሩት}}

# contractTimeLeftMinutes
source: {count,plural, =1{{count} minute left} other{{count} minutes left}}
am: {count,plural, =1{{count} ደቂቃ ቀረው} other{{count} ደቂቃዎች ቀሩት}}

# drawerMyTrips
source: My Trips
am: የእኔ ጉዞዎች

# mySubscriptionsTitle
source: My Subscriptions
am: የእኔ ምዝገባዎች

# confirmRideTitle
source: Confirm Your Ride
am: ጉዞዎን ያረጋግጡ

# bookingUnderContract
source: Booking under: {contractType}
am: የሚይዙት በ: {contractType} ውል ነው

# tripSummaryTitle
source: TRIP SUMMARY
am: የጉዞ ማጠቃለያ

source: Assigned Driver
am: የተመደበ ሹፌር

source: Driver Contact
am: የሹፌር ስልክ

source: Vehicle
am: ተሽከርካሪ

# plateNumber
source: Plate No.
am: የሰሌዳ ቁጥር

source: Contract Price
am: የውል ዋጋ

source: Trip Distance
am: የጉዞ ርቀት

source: Payment Status
am: የክፍያ ሁኔታ

source: Subscription Status
am: የምዝገባ ሁኔታ

source: Validity
am: የአገልግሎት ጊዜ

source: Driver Pending
am: ሹፌር በመጠባበቅ ላይ

source: Negotiated
am: በስምምነት

source: Confirm Today's Pickup
am: የዛሬን ጉዞ ያረጋግጡ

source: Explore Contracts
am: ውሎችን ያስሱ

source: Refresh
am: አድስ

source: Retry
am: እንደገና ሞክር

# rideSubscriptionFallbackTitle
source: Ride Subscription
am: የጉዞ ምዝገባ

source: Base Price
am: የመነሻ ዋጋ

source: Minimum Fare
am: ዝቅተኛ ክፍያ

source: Max Passengers
am: ከፍተኛ የተሳፋሪ ብዛት

# featureWifi
source: WiFi
am: ዋይፋይ

# featureAC
source: A/C
am: ኤሲ

# featurePremiumSeats
source: Premium Seats
am: ፕሪሚየም መቀመጫዎች

# featurePrioritySupport
source: Priority Support
am: ቅድሚያ የሚሰጥ ድጋፍ

# availableContractsTitle
source: Available Contracts
am: ያሉ ውሎች

# noContractsAvailableTitle
source: No Contracts Available
am: ምንም ውል የለም

# noContractsAvailableMessage
source: Please check back later for new subscription offers.
am: እባክዎ ለአዲስ የደንበኝነት ምዝገባ ቅናሾች ቆይተው እንደገና ይሞክሩ።

# failedToLoadContractsTitle
source: Failed to Load Contracts
am: ውሎችን መጫን አልተቻለም

# failedToLoadContractsMessage
source: Please check your internet connection and try again.
am: እባክዎ የበይነመረብ ግንኙነትዎን ያረጋግጡ እና እንደገና ይሞክሩ።

source: Base Rate
am: የመነሻ ዋጋ

# selectAndPickRoute
source: Select & Pick Route
am: መርጠው መንገድ ይምረጡ

source: My Transactions
am: የእኔ እንቅስቃሴዎች

# errorPrefix
source: An Error Occurred
am: ስህተት

source: Current Wallet Balance
am: የአሁኑ የኪስ ቦርሳ ቀሪ ሂሳብ

source: Transaction History
am: የእንቅስቃሴ ታሪክ

source: No Transactions Yet
am: እስካሁን ምንም እንቅስቃሴ የለም

source: Your recent transactions will appear here.
am: የቅርብ ጊዜ እንቅስቃሴዎችዎ እዚህ ይታያሉ።

# transactionStatusCompleted
source: Completed
am: ተጠናቋል

# transactionStatusPending
source: Pending
am: በመጠባበቅ ላይ

# transactionStatusFailed
source: Failed
am: አልተሳካም

source: Subscription Details
am: የምዝገባ ዝርዝሮች

source: Status
am: ሁኔታ

source: Payment
am: ክፍያ

source: Route Information
am: የመንገድ መረጃ

source: Pickup
am: መነሻ

source: Dropoff
am: መድረሻ

source: Distance
am: ርቀት

source: Financials
am: ፋይናንስ

source: Base Fare
am: የመሠረት ዋጋ

source: Final Fare
am: የመጨረሻ ዋጋ

source: Name
am: ስም

source: Phone
am: ስልክ

source: Passenger Details
am: የተሳፋሪ ዝርዝሮች

source: Identifiers
am: መለያዎች

source: Subscription ID
am: የምዝገባ መለያ

source: Contract ID
am: የኮንትራት መለያ

source: Passenger ID
am: የተሳፋሪ መለያ

source: Driver ID
am: የሹፌር መለያ

source: Not Assigned
am: አልተመደበም

source: Call Driver
am: ወደ ሹፌሩ ይደውሉ

source: days left
am: የቀሩ ቀናት

# expiresToday
source: Har'a Xumurama
am: ዛሬ ጊዜው ያልፍበታል

# statusExpired
source: Xumurameera
am: ጊዜው አልፎበታል

# daysLeftSingular
source: Guyyaan {count} hafe
am: {count} ቀን ቀረው

# daysLeftPlural
source: Guyyoonni {count} hafan
am: {count} ቀናት ቀሩት

source: New Subscription Request
am: አዲስ የምዝገባ ጥያቄ

# subscribingTo
source: Subscribing to: {contractType}
am: ለ {contractType} በመመዝገብ ላይ

# reviewRequestPrompt
source: Please confirm your route and select the desired duration for your subscription.
am: እባክዎ መንገድዎን ያረጋግጡ እና የሚፈልጉትን የምዝገባ ጊዜ ይምረጡ።

source: Your Route
am: የእርስዎ መንገድ

source: Dropoff Location
am: መድረሻ ቦታ

source: Subscription Duration
am: የምዝገባ ጊዜ

# selectDateRange
source: Tap to select date range
am: የቀን ክልል ለመምረጥ ይንኩ

# pleaseSelectDateRange
source: Please select a start and end date.
am: እባክዎ የመነሻ እና የመድረሻ ቀን ይምረጡ።

source: Proceed to Payment
am: ወደ ክፍያ ይቀጥሉ

source: Request Submitted!
am: ጥያቄው ገብቷል!

# approvalNotificationPrompt
source: Your subscription request has been sent for administrative approval. You will be notified once it is active.
am: የምዝገባ ጥያቄዎ አስተዳደራዊ ይሁንታ ለማግኘት ተልኳል። ገቢር ሲሆን ይነገርዎታል።

source: Done
am: ተከናውኗል

# paymentScreenTitle
source: Complete Your Payment
am: ክፍያዎን ያጠናቅቁ

# paymentConfirmTitle
source: Confirm Your Payment
am: ክፍያዎን ያረጋግጡ

# paymentTotalAmount
source: Total Amount: ETB {amount}
am: አጠቃላይ መጠን: ETB {amount}

# paymentSelectGateway
source: Select your preferred payment gateway or upload a bank receipt.
am: የሚመርጡትን የክፍያ መግቢያ ይምረጡ ወይም የባንክ ደረሰኝ ይስቀሉ

# paymentPreferredMethod
source: PREFERRED METHOD
am: ተመራጭ ዘዴ

# paymentOtherGateways
source: OTHER GATEWAYS
am: ሌሎች የክፍያ መግቢያዎች

# paymentChooseGateway
source: CHOOSE A GATEWAY
am: የክፍያ መግቢያ ይምረጡ

# paymentViewMoreOptions
source: View More Options
am: ተጨማሪ አማራጮችን ይመልከቱ

# paymentPayWith
source: Pay with {methodName}
am: በ {methodName} ይክፈሉ

# paymentSelectAGateway
source: Select a Gateway
am: የክፍያ መግቢያ ይምረጡ

# paymentOr
source: OR
am: ወይም

# paymentUploadBankReceipt
source: Upload Bank Receipt
am: የባንክ ደረሰኝ ይስቀሉ

# paymentManualUploadTitle
source: Manual Payment Upload
am: የባንክ ደረሰኝ መስቀያ

# paymentManualUploadSubtitle
source: Enter the bank transaction reference and upload a screenshot of your receipt.
am: የባንክ የግብይት ቁጥር ያስገቡ እና የደረሰኝዎን ፎቶ ይስቀሉ

# paymentTxnReferenceLabel
source: Transaction Reference
am: የግብይት ቁጥር

# paymentTxnReferenceRequired
source: This field is required
am: ይህንን መሙላት ያስፈልጋል

# paymentTapToSelectReceipt
source: Tap to select receipt image
am: ደረሰኝ ለመምረጥ ይጫኑ

# paymentSubmitForReview
source: Submit for Review
am: ለግምገማ አስገባ

# paymentErrorLoading
source: Error loading payment methods: {error}
am: የክፍያ አማራጮችን መጫን አልተቻለም: {error}

# paymentNoMethodsAvailable
source: No payment methods available.
am: ምንም የክፍያ አማራጮች የሉም

# paymentSuccessDialogTitle
source: Confirmation Sent!
am: ማረጋገጫ ተልኳል!

# paymentSuccessDialogContent
source: A request has been sent to your phone. Please enter your PIN to approve the payment.
am: ወደ ስልክዎ ጥያቄ ተልኳል። እባክዎ ክፍያውን ለማጽደቅ ፒንዎን ያስገቡ።

# paymentErrorDialogTitle
source: Payment Error
am: የክፍያ ስህተት

# paymentManualSuccessTitle
source: Upload Successful
am: በተሳካ ሁኔታ ተሰቅሏል

# paymentManualSuccessContent
source: Your payment proof has been submitted and is pending review.
am: የክፍያ ማረጋገጫዎ ቀርቧል እና ግምገማ ላይ ነው።

# paymentOkButton
source: OK
am: እሺ

# paymentErrorSnackbar
source: Error: {message}
am: ስህተት: {message}

# contractsSectionTitle
source: Apply a Ride Plan
am: የጉዞ ፕላን ይጠቀሙ

# contractsSectionDescription
source: Use a pre-paid weekly or monthly plan to get special rates for this trip.
am: ለዚህ ጉዞ ልዩ ዋጋ ለማግኘት የቅድመ ክፍያ ሳምንታዊ ወይም ወርሃዊ ፕላን ይጠቀሙ።

source: Enter Code
am: ኮዱን ያስገቡ

# otpScreenSubtitle
source: We sent a verification code to {phoneNumber}
am: የማረጋገጫ ኮድ ወደ {phoneNumber} ልከናል

# verifyButton
source: VERIFY
am: አረጋግጥ

# didNotReceiveCodeResend
source: Didn't receive code? Resend
am: ኮድ አልደረሰዎትም? እንደገና ይላኩ

# resendCodeIn
source: Resend code in {seconds}s
am: በ {seconds} ሰከንድ ውስጥ እንደገና ይላኩ

# enterValidOtp
source: Please enter a valid 6-digit code.
am: እባክዎ ትክክለኛ ባለ 6-አሃዝ ኮድ ያስገቡ።

source: Resending OTP...
am: ኮዱን እንደገና በመላክ ላይ...
